xmlcf/Documents/ПриобртениеАктива.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>ПриобртениеАктива</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.АктивыОстатки</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Портфель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Портфель</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Актив</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Активы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СуммаАктива</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаКомиссии</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СуммаАктива</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

xmlcf/AccumulationRegisters/ОстаткиДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиДенежныхСредств</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма10</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийПриходРасходДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюта</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Портфель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Портфель</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

xmlcf/AccumulationRegisters/АктивыОстатки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<AccumulationRegister>
		<Properties>
			<Name>АктивыОстатки</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма10</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Актив</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Активы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюта</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Портфель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Портфель</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументПарти</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПриобртениеАктива</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:DocumentRef.ПродажаАктива</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

xmlcf/Enums/ВидыОперацийПриходРасходДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ВидыОперацийПриходРасходДенежныхСредств</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПополнениеБрокерскогоСчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыводСБрокерскогоСчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыплатаКупона</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыплатаДивидендов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПродажаАктива</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриобретениеАктива</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбменВалюты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КомиссияБрокера</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НКД</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

xmlcf/Documents/ПриобртениеАктива/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Отказ = Ложь;	
	
	ПроверитьВозможностьПроведения(Отказ);	
	
	Если НЕ Отказ тогда
		ВыполнитьДвиженияПоРегистрам();
	КонецЕсли;	
	
КонецПроцедуры

Процедура ПроверитьВозможностьПроведения(Отказ)
	
	Движения.ОстаткиДенежныхСредств.Очистить();
	Движения.ОстаткиДенежныхСредств.Записывать = Истина;
	Движения.Записать();
	
	Движения.АктивыОстатки.Очистить();
	Движения.АктивыОстатки.Записывать = Истина;
	Движения.Записать();

	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОстаткиДенежныхСредствОстатки.Валюта КАК Валюта,
		|	ОстаткиДенежныхСредствОстатки.Портфель КАК Портфель,
		|	СУММА(ОстаткиДенежныхСредствОстатки.СуммаОстаток) КАК СуммаОстаток
		|ИЗ
		|	РегистрНакопления.ОстаткиДенежныхСредств.Остатки(
		|			&Период,
		|			Портфель = &Портфель
		|				И Валюта = &Валюта) КАК ОстаткиДенежныхСредствОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ОстаткиДенежныхСредствОстатки.Валюта,
		|	ОстаткиДенежныхСредствОстатки.Портфель";
	
	Запрос.УстановитьПараметр("Валюта", Актив.Валюта);
	Запрос.УстановитьПараметр("Период", Дата);
	Запрос.УстановитьПараметр("Портфель", Портфель);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ВыборкаДетальныеЗаписи.СуммаОстаток < (Сумма + СуммаКомиссии + НКД) тогда
			Отказ = Истина;
		КонецЕсли;
	КонецЦикла;	
		
КонецПроцедуры

Процедура ВыполнитьДвиженияПоРегистрам()
	
	Движения.АктивыОстатки.Записывать = Истина;
	Движение = Движения.АктивыОстатки.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Портфель = Портфель;
	Движение.ДокументПарти = Ссылка;
	
	Движение.Валюта = Актив.Валюта;
	Движение.Сумма = Сумма;
	Движение.Количество = Количество;
	
	
	Движения.ОстаткиДенежныхСредств.Записывать = Истина;
	Движение = Движения.ОстаткиДенежныхСредств.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;;
	Движение.Период = Дата;
	Движение.ВидОперации = Перечисления.ВидыОперацийПриходРасходДенежныхСредств.ПриобретениеАктива;
	Движение.Портфель = Портфель;
	
	Движение.Валюта = Актив.Валюта;
	Движение.Сумма = Сумма;
	
	
	Если СуммаКомиссии <> 0 тогда
		Движения.ОстаткиДенежныхСредств.Записывать = Истина;
		Движение = Движения.ОстаткиДенежныхСредств.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.ВидОперации = Перечисления.ВидыОперацийПриходРасходДенежныхСредств.КомиссияБрокера;		
		Движение.Портфель = Портфель;
		
		Движение.Валюта = Актив.Валюта;
		Движение.Сумма = СуммаКомиссии;
	КонецЕсли;
	
	Если НКД <> 0 тогда
		Движения.ОстаткиДенежныхСредств.Записывать = Истина;
		Движение = Движения.ОстаткиДенежныхСредств.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.ВидОперации = Перечисления.ВидыОперацийПриходРасходДенежныхСредств.НКД;		
		Движение.Портфель = Портфель;
		
		Движение.Валюта = Актив.Валюта;
		Движение.Сумма = НКД;
	КонецЕсли;
	
КонецПроцедуры
